Revit 2024 API
RenderingSettings.GetRenderingQualitySettings Method
 Returns an object that represents the rendering quality settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RenderingQualitySettings GetRenderingQualitySettings()
Visual Basic
Public Function GetRenderingQualitySettings As RenderingQualitySettings
Visual C++
public:
RenderingQualitySettings^ GetRenderingQualitySettings()
Return Value
 The rendering quality settings.
See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace